In [44]:
import pandas as pd 
import numpy as np

we use pandas read_csv function to read 
the csv file in python and pandas
dataframe method to convert file into the 
date frame

In [9]:
df = pd.DataFrame(pd.read_csv
('/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [46]:
df.shape

(891, 12)

Description of the attributes of the 
dataset 

Pclass:Passenger class(1 =1st;2 =2nd;3
=3rd)

survival:Survival(0 = No;1 = =Yes)

name:Name

sex:Sex

age:Number of sibilings/spouses Abroad

parch:Number of parent/Childern Abroad

ticket:Ticket Number

fare:Passenger fare(British Pound)

cabin:Cabin 

embarked:Port  of  embarkation(C  =
cherbourg;Q    =   Quenstown;S    =
sowthampton

In [45]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

seprting out the columns which have 
more than 35% of the values missing in 
the dataset

In [47]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [48]:
drop_col.index

Index(['Cabin'], dtype='object')

In [60]:
df.drop(drop_col.index, axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [62]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

for Embrared attribute,we fill the NULL value with the most frquest vlues in the column

In [63]:
df['Embarked'].fillna('s',inplace=True)

In [64]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [65]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

sibp:Number of sibilings/spouses abroud parch:Number of parent/children Abroad so we can make a new column faily_size by combining these two columns

In [71]:
df['FamilySize'] = df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'],axis=1,inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500    0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067   -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.301914  0.217138    1.000000

Familysize in the ship dose not have much corrleance withy the survival rate
let's check wheather the preson was alone or not can affect the survival rate

In [75]:
df['Alone']=[0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [77]:
df.groupby (['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

if the person is alone he/she has less chance of being survived 
the reson might be the person who i travelling with his family might be belonging to the prioritized over other

In [79]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So we can if the person was not Alone, the chance the ticket pricing is higher is high

In [82]:
df['Sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
1    0.383838
Name: Survived, dtype: float64

it show,Female passagers have mare chance of surviving than male ones.
it shows women were prioritized over men.

In [83]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
s    1.000000
Name: Survived, dtype: float64

CONCLUS
1.Female passenger were prioritized over men.
2.People with high or rich people have survival rate than other.the hierarichy might have been folloed while saving the passengers
3.Passanger travelling with their family have survival rate 
4.passage who boreded the ship at cherbourg.survived more in propotion then the other